Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Secretary Out-of-Order.tmx
Source language: en
Languages: es_419

source: I was just…
es_419: Es que…

source: you know, I can't die in peace without knowing you're married.
es_419: Te digo, no podré morir en paz sabiendo que aún no te has casado.

source: then…
es_419: Bueno…

source: with some strange confidence, just today…
es_419: Con cierta confianza extraña, justo hoy…

source: y-yes?!
es_419: ¡¿S-sí?!

source: I'll think it over and get back to you.
es_419: Lo pensaré y le responderé.

source: so... what do you do on the weekends?
es_419: Y… ¿qué hace los fines de semana?

source: you should also tell me why.
es_419: También deberías decirme por qué.

source: Assistance
es_419: Con ayuda de:

source: earlier--
es_419: Antes…

source: and… you'll know this by now, but I get rude and I eat a lot when I'm drunk.
es_419: Y… seguro ya lo sabe, pero cuando bebo me pongo maleducada y como mucho.

source: hmmm...
es_419: Mmm…

source: softie
es_419: BLANDITA

source: let's get out of this car.
es_419: Salgamos del coche.

source: shine
es_419: BRILLO

source: what?! now?!
es_419: ¡¿Qué, ahora?!

source: looks
es_419: BUSCA

source: come on! fire me all you want!
es_419: ¡Vamos! ¡Atácame con todo!

source: hm...
es_419: Mm…

source: water
es_419: agua

source: what happened to your arm? want me to sign your cast?
es_419: ¿Qué te pasó en el brazo? ¿Quieres que te decore el yeso?

source: oh, sorry.
es_419: Ah, perdón.

source: I don't have to read it to know what he wrote.
es_419: Ni me hace falta leerla, ya sé qué escribió.

source: sweep
es_419: FRUUS

source: I was wondering why he wasn't commenting on my outfit.
es_419: Se me hacía raro que no dijera nada de mi ropa.

source: you don't have to do all this just for me.
es_419: No tiene por qué hacer todo esto por mí.

source: sir! over here!
es_419: ¡Por aquí, señor!

source: ...going...
es_419: … está…

source: ...I had to commute from home to the office to mr. chae's place and back and forth every day.
es_419: … tenía que viajar de casa a la oficina y a la casa del señor Chae, ir y volver varias veces al día.

source: How to properly discipline a child out-of-order
es_419: Cómo disciplinar a un niño descarriado

source: so I swam like crazy.
es_419: Así que nadaba como loca.

source: wobble
es_419: TAMBALEA

source: what…!?
es_419: ¡¿Qué?!…

source: badump
es_419: TUTUM

source: you're dismissed.
es_419: Puedes irte.

source: wow, I knew you were good, but still... wow.
es_419: Guau, sabía que eras buena, pero… Guau.

source: why do you think it's all over?
es_419: ¿Por qué piensa que ya se acabó?

source: ms.
es_419: Señorita

source: what?
es_419: ¿Qué?

source: but they realize dreams are just that and feel lost.
es_419: pero descubren que los sueños son solo eso y se desorientan.

source: k y a a a
es_419: A I A A A

source: yes, mr. chae has...
es_419: Sí, el señor Chae…

source: we already ate grilled beef ribs.
es_419: Ya comimos costillas asadas.

source: because I have a crush on my boss!
es_419: ¡Porque me gusta mi jefe!

source: poison
es_419: VENENO

source: why don't you go on home and rest?
es_419: ¿Por qué no vas a casa a descansar?

source: excuse me?
es_419: ¿Perdón?

source: and office workers like me in their second or third year dream of making a new start.
es_419: Y oficinistas, como yo, con dos o tres años de antigüedad que sueñan con volver a empezar.

source: that was my only way to get you to stay since you'd already submitted your letter of resignation.
es_419: Era mi única forma de hacer que te quedaras, ya que has presentado tu carta de renuncia.

source: why did I wear this to work?
es_419: ¿Por qué vine así al trabajo?

source: you're out of your mind!
es_419: ¡Te volviste loca!

source: so I became a secretary who was never tardy.
es_419: Así, ahora soy una secretaria que no llega tarde.

source: offer
es_419: OFRECE

source: ugh!
es_419: ¡Argh!

source: dohyeok doesn't know anything!
es_419: ¡Dohyeok no sabe nada!

source: come on, I told you not to call me that.
es_419: Ay, te pedí que no me llamaras así.

source: I need to resign! waah!
es_419: ¡Tengo que renunciar! ¡Buaa!

source: and here I was, touched by your sweetness.
es_419: Y yo aquí, conmovida por tu dulzura.

source: cooking is about precise measurements!
es_419: ¡Para cocinar hace falta precisión!

source: you're a liar!
es_419: … ¡un mentiroso!

source: I'm sorry.
es_419: Lo siento.

source: people live to be 100 nowadays, so I still have 70 years.
es_419: Hoy la gente vive hasta los 100 años, me quedarán 70 más.

source: No, I should be the one apologizing.
es_419: No, soy yo quien debe disculparse.

source: …but I'd feel bad if I were you.
es_419: … pero me sentiría mal si fuera tú.

source: art by QuornQuorn original work by Parand
es_419: arte de QuornQuorn obra original de Parand

source: can you invite me more often?
es_419: ¿Me puedes invitar más seguido?

source: honest
es_419: SINCERO

source: change of subject!
es_419: ¡Cambio de tema!

source: ...we're equally bad!
es_419: ¡Los dos somos malos!

source: oh, well, no, I find you very hot.
es_419: Ah, pues no, me resulta muy guapo.

source: I'm fine!
es_419: estoy bien!

source: that!
es_419: ¡Aquello!

source: I-I see.
es_419: Ya… veo.

source: ugh, that's strong!
es_419: ¡Uff, qué fuerte!

source: I'm going to live stress-free from now on.
es_419: Desde ahora viviré sin tanta angustia.

source: lunch
es_419: almuerzo

source: ...he's dohyeok chae's friend!!!
es_419: ¡¡Es amigo de Dohyeok!!

source: …a life like that!
es_419: … ¡mi vida sea así!

source: smile
es_419: SONRÍE

source: I was too excited about winning the lottery.
es_419: Fue la emoción por haber ganado la lotería.

source: break up with my son!
es_419: ¡Sepárate de mi hijo!

source: mumble
es_419: BALBUCEA

source: clack
es_419: CLAC

source: A kiss isn't a big deal.
es_419: Un beso no es gran cosa.

source: swaaaaa
es_419: BRRRR

source: I've never spent so much on myself before.
es_419: Es la primera vez que gasto tanto en mí misma.

source: this company isn't bad after all?
es_419: ¿la empresa no está tan mal, al final?

source: I wasn't planning on giving it to you...
es_419: No tenía intenciones de dártela…

source: psychology consultation 9:30
es_419: Consulta psicológica 9:30

source: shimmer
es_419: FRUU

source: oh! y-yeah…
es_419: ¿Eh? Ah, s-sí…

source: I'd like to tell you something.
es_419: Quisiera contarte algo.

source: it's okay.
es_419: Está bien.

source: hug
es_419: ABRAZA

source: go on.
es_419: Vamos.

source: MURMUR
es_419: MURMULLO

source: Did I keep you waiting?
es_419: ¿Te hice esperar mucho?

source: we didn't have to come this far--
es_419: No hacía falta venir tan lejos…

source: I knew it.
es_419: Lo sabía.

source: there's so much I need to be careful about!
es_419: ¡Me tengo que cuidar de muchas cosas!

source: he might look handsome and all...
es_419: Sí, quizás parezca apuesto y todo…

source: you know, until now, I didn't think he was interested in women!
es_419: ¿Sabes qué? ¡Hasta ahora, creí que no le interesaban las mujeres!

source: I'm glad it's better.
es_419: Me alegra que esté mejor.

source: I've seen people who left their jobs early to get married, start a business, and the like,
es_419: He visto gente dejar su empleo antes para casarse, empezar una empresa y cosas así,

source: I didn't "bring her home."
es_419: No la "traje a casa".

source: y-you're from a wealthy family.
es_419: S-su familia tiene mucho dinero.

source: set up a meeting on monday with that company.
es_419: Organiza una reunión el lunes con esa empresa.

source: yumyum
es_419: ñamñam

source: I'm sorry, dohyeok!
es_419: ¡Perdón, Dohyeok!

source: hyorin, what's going on with your brother? he looks happy.
es_419: Hyorin, ¿qué está pasando con tu hermano? Lo veo contento.

source: chases demons, ultimate remedy, health
es_419: ahuyenta demonios, remedio definitivo, salud

source: what is it? why are you…
es_419: ¿Qué pasa? ¿Por qué…?

source: should I just leave the documents here?
es_419: ¿Le dejo los documentos por aquí?

source: she's getting worse by the day.
es_419: Cada día está peor.

source: wait...
es_419: Espera…

source: Then is the boss...?
es_419: ¿Entonces el jefe…?

source: isn't it?
es_419: ¿Cierto?

source: oh, thank you!
es_419: ¡Ah, gracias!

source: how did it happen?! which type?! real estate?! stocks?! did you report it to the police?!
es_419: ¡¿Cómo pasó?! ¡¿Con qué?! ¡¿Propiedades, en la bolsa?! ¡¿Ya hiciste la denuncia en la policía?!

source: then I'll also…
es_419: Pues yo también…

source: I'm relieved.
es_419: Qué alivio.

source: really?
es_419: ¿En serio?

source: let me explain how all this--
es_419: Te explicaré cómo fue todo…

source: your blood sugar level will rise too high if you skip breakfast, which will increase the risk of diabetes.
es_419: Si te saltas el desayuno, te subirá mucho el azúcar en sangre, y eso aumenta el riesgo de desarrollar diabetes.

source: let's not scold her.
es_419: No la regañaré.

source: then when are you free after work this week?
es_419: Bueno, cuándo estás libre después del trabajo?

source: jiyun lee (back-up secretary)
es_419: Jiyun Lee (secretaria de respaldo)

source: Are we though?
es_419: Pero ¿es cierto?

source: correct. now, set up a meeting with mr. nam this evening.
es_419: Correcto. Agenda una reunión con el señor Nam para esta noche.

source: why am I lying down?
es_419: ¿Qué hago acostada?

source: as her boyfriend.
es_419: Como su novio.

source: No way...
es_419: Qué locura…

source: I held my breath and used every ounce of energy I had.
es_419: Contenía la respiración y usaba cada gramo de energía que tenía.

source: oh, I'm having lunch with someone. enjoy your lunch.
es_419: Ah, y salgo a almorzar. Que disfrutes tu almuerzo.

source: there's no need.
es_419: No hace falta.

source: burst
es_419: ZAS

source: right! jiwoo!
es_419: ¡Cierto, Jiwoo!

source: that his position was given by chance.
es_419: Que él llegó a su puesto de casualidad.

source: this isn't much.
es_419: No es tanto.

source: he was trying to screw me over as you said.
es_419: intentaba arruinarme la vida, como dijiste.

source: LIVE
es_419: VIDA

source: I just…
es_419: Yo te…

source: I didn't know the secretary's office was that cold...
es_419: No sabía que la oficina de la secretaria era tan fría…

source: oh, that…
es_419: Ah, ese…

source: I was actually wondering about that.
es_419: En realidad sí quería saber eso.

source: I'll make breakfast.
es_419: Haré el desayuno.

source: recite
es_419: RECITA

source: gasp
es_419: AAAH

source: I hit the lottery.
es_419: me gané la lotería.

source: cheers
es_419: ¡Salud!

source: it's been years.
es_419: de hace mucho.

source: there's a good place that's a short walk away. let's go there.
es_419: Hay un lugar bueno por aquí cerca. Vamos ahí.

source: yu-eun, I'll do the rest. you may go.
es_419: Yo termino aquí, Yu-eun. Puedes irte.

source: we're having a barbecue for the farewell party
es_419: Vamos a hacer una parrillada de despedida.

source: * about $7,250 USD.
es_419: * MÁS O MENOS USD 7250.

source: employee from fleeing
es_419: empleada huyera durante

source: so I don't remember much now.
es_419: Así que ya no recuerdo mucho.

source: oh.
es_419: Ah.

source: sorry if I bored you. that only applies to me, so ignore what I said.
es_419: Perdón si esto aburre. Solo sirve para mí, así que ignora lo que dije.

source: you... have your hair down.
es_419: Te… has cambiado el peinado.

source: it reminds me of the days when I stood on my own feet.
es_419: Me recuerda a cuando empecé a valerme por mí misma.

source: and he's using his personal credit card,
es_419: Y va a usar su tarjeta de crédito personal,

source: I'll respect your decision.
es_419: Respetaré tu decisión.

source: c
es_419: g

source: and he brings me to the cafeteria?
es_419: ¿Y me trae al comedor?

source: sit on this chair!
es_419: ¡Siéntate en la silla!

source: something on your mind these days?
es_419: preocupada por algo últimamente?

source: I mean it.
es_419: En serio.

source: dohyeok, you...
es_419: Dohyeok, al fin…

source: wow
es_419: GUAU

source: yikes. it‘s mr. chae.
es_419: Auch, es el señor Chae.

source: shiver
es_419: BRRR

source: but please let go of my hand!
es_419: ¡Pero suélteme, por favor!

source: now I think I know…
es_419: Ahora creo que entiendo…

source: A rabbit?
es_419: ¿Un conejo?

source: when I first started, it didn't take long for me to get promoted.
es_419: Cuando empecé, me ascendieron bastante rápido.

source: so it's possible.
es_419: Es posible.

source: there's nothing to apologize for.
es_419: No tienes por qué disculparte.

source: sir…
es_419: Señor…

source: BUSINESS
es_419: NEGOCIOS

source: oh, I forgot!
es_419: ¡Ah, me olvidé!

source: but, he had no interest in running a business so he became a movie director instead.
es_419: Pero no le interesaba manejar una empresa, así que se convirtió en director de cine.

source: huh?!
es_419: ¡¿Eh?!

source: murmur
es_419: MURMURA

source: I don't like the smell.
es_419: Me desagrada el olor.

source: financial counseling with FD 10:00
es_419: Asesoría financiera 10:00

source: first time he sent a message to the wrong person!
es_419: ¡Es la primera vez que se equivoca de contacto!

source: everyone
es_419: global

source: I assumed you'd dump me someday as you did my predecessors.
es_419: Imaginé que me abandonaría algún día, como hizo con el resto.

source: iren‘s masterpiece? who is he?
es_419: ¿Obra maestra de IREN? ¿Quién es?

source: come in.
es_419: Adelante.

source: ponder
es_419: piensa

source: this must be his house!
es_419: ¡Debe ser su casa!

source: I kept telling myself it was wrong and tried to stop, but...
es_419: Me repetía todo el tiempo que estaba mal, traté de evitarlo, pero…

source: but I was wrong.
es_419: Pero me equivoqué.

source: which means he's in a different world too.
es_419: O sea que él también se maneja en otro mundo.

source: rather, I'm grateful... because I got a crash course on how to do my job well.
es_419: Más bien, le agradezco… porque aprendí de golpe cómo hacer bien mi trabajo.

source: that's crazy lol I bet he'll sue
es_419: Qué locura jojo seguro la demanda

source: I-I'm not saying I'm worried about him!
es_419: ¡N-no estoy diciendo que me preocupa!

source: Please Approve
es_419: Para aprobar

source: it was like I was floating on top of a strong current that I couldn't go against.
es_419: Era como estar flotando sobre una corriente fuerte, y no poder nadar contra ella.

source: asset manager qualitifaction exam center
es_419: Centro Evaluador de Asesoría Financiera

source: s-sir?
es_419: ¿S-Señor?

source: I'm your bro!
es_419: ¡Soy tu amigo!

source: mr. chae?!
es_419: ¡¿Señor Chae?!

source: because I had to pay the bills.
es_419: Porque tenía que pagar las cuentas.

source: people who run toward the finish line all their lives...
es_419: Las personas que se pasan la vida corriendo hacia la meta…

source: fever
es_419: FIEBRE

source: I know you've been worried about me.
es_419: Sé que has estado preocupada por mí.

source: it's kind of confusing.
es_419: puede ser confuso.

source: I'm going to run out real soon if I keep spending like this.
es_419: Si sigo gastando así, me voy a quedar sin nada enseguida.

source: whish
es_419: FIUM

source: to make it even.
es_419: Para estar a mano.

source: clench
es_419: APRIETA

source: you don't know how to take things easy.
es_419: No sabes tomarte las cosas con calma.

source: I was impatient.
es_419: Era impaciente.

source: how pathetic!
es_419: ¡Qué patético!

source: I love free food!
es_419: ¡Genial, comida gratis!

source: a goal...
es_419: Una meta…

source: his texts are getting longer.
es_419: Sus mensajes son más largos.

source: I finally have some time off. can't I enjoy it for a bit?
es_419: Al fin tengo tiempo libre. ¿No lo puedo disfrutar un poco?

source: I finally have enough money in my hands...
es_419: Al fin tengo bastante dinero en las manos…

source: slam
es_419: BLAM

source: I thought he didn't know how to appreciate...
es_419: Yo pensé que no lo sabía valorar…

source: hey dohyeok, it's me.
es_419: Hola, Dohyeok, soy yo.

source: haha!
es_419: ¡Ja, ja!

source: I was just working on my weekly schedule.
es_419: Estaba armando un cronograma semanal.

source: just say anything.
es_419: Di cualquier cosa y ya.

source: I think my secretary...
es_419: Creo que mi secretaria…

source: Before then, you always looked like a rabbit who was being pressed for time.
es_419: Antes de eso, siempre parecías un conejo que estaba llegando tarde a todo.

source: I'd like to get permission for our relationship…
es_419: Quería pedirte permiso para salir con ella…

source: Were you thinking about...
es_419: ¿Estabas pensando en…

source: flop
es_419: PLOF

source: Rumors about how he mistreated his employees were widely spread online.
es_419: En internet corrían muchísimos rumores sobre maltrato al personal.

source: on my mind?
es_419: ¿Preocupada?

source: if that were the case, then my parents wouldn't have been in an accident like that.
es_419: Si así fuera, mis padres no habrían tenido ese accidente.

source: yeah? well, he should be!
es_419: ¿Sí? ¡Pues más le vale!

source: did you like that about me that much?
es_419: ¿Tanto le gustaba eso de mí?

source: I realized that countless things sped by me regardless of my will.
es_419: Me di cuenta de que muchas cosas pasaban por mi lado sin mi voluntad.

source: so I don't have to fill out an expense report!
es_419: ¡no tendré que completar un informe de gastos!

source: there's no difference...
es_419: Son idénticos…

source: quickly
es_419: enseguida

source: we're going out. we're not having an affair.
es_419: Estamos saliendo en serio. No es un romance.

source: bow
es_419: REVERENCIA

source: ugh. this stupid intranet.
es_419: Uff. Estúpida intranet.

source: ...it's finally happening.
es_419: … al fin está pasando.

source: oh. was that not what you were about to ask?
es_419: Ah. ¿No era eso lo que quería preguntar?

source: I see...
es_419: Ya veo…

source: that's what I wanted to hear.
es_419: Eso quería oír.

source: thanks to you...
es_419: Gracias a ti…

source: if you don't like him, you can just leave.
es_419: Si no te gusta, puedes levantarte e irte.

source: there we go.
es_419: Ya estamos.

source: - episode 11 -
es_419: - episodio 11 -

source: what are you doing here?
es_419: ¿Qué haces aquí?

source: s-sir!
es_419: ¡S-Señor!

source: I didn't know what I was doing.
es_419: Yo no sabía lo que hacía.

source: are you sick? maybe we should shop another day.
es_419: ¿Estás enferma? Mejor vamos de compras otro día.

source: it'll be fine!
es_419: ¡Va a estar bien!

source: no! why would you--
es_419: ¡No! ¿Por qué habría…?

source: silence
es_419: SILENCIO

source: please call me again if you need anything, sir.
es_419: Si necesita algo, no dude en llamarme, señor.

source: don't you know what you have done to her?
es_419: ¿Tienes idea de lo que le has hecho?

source: umph
es_419: Uuf

source: I think...
es_419: Creo que…

source: Wow, all the pictures I take look so good!
es_419: ¡Guau, todas mis fotos son muy buenas!

source: I'm only his secretary.
es_419: Soy su secretaria, nada más.

source: you can do this!
es_419: ¡Tú puedes!

source: who knows? maybe it's because I'm a nobody to him.
es_419: ¿Qué sé yo? Quizás ni existo para él.

source: ...the company is all I've got!
es_419: … ¡lo único en mi vida es mi empleo!

source: dohyeok's wife
es_419: Esposa de Dohyeok

source: I saw her a couple times.
es_419: La vi un par de veces.

source: katalk!
es_419: ¡Tururín!

source: ahem
es_419: Ejem

source: so this was why there was an ambulance in front of the company!
es_419: ¡Con razón había una ambulancia en la puerta de la empresa!

source: first, he's got me.
es_419: Primero, me tiene a mí.

source: you two have a great time.
es_419: Que la pasen muy bien.

source: I can't focus on anything after what happened yesterday.
es_419: No puedo pensar en nada desde lo que pasó ayer.

source: my head is up in the air.
es_419: Me creo no sé qué.

source: focused
es_419: CONCENTRADO

source: I didn't even have a chance to talk with him.
es_419: Ni siquiera pude hablar con él.

source: should we go somewhere quiet?
es_419: ¿Vamos a un lugar más tranquilo?

source: but it's not as hard as I thought.
es_419: Pero no es tan difícil como pensaba.

source: as for me...
es_419: Mientras yo…

source: then change the dates for all the other meetings.
es_419: Pues cambia de fecha todas las otras reuniones.

source: to have such a good father…
es_419: de tener tan buen padre…

source: the company's annual profits skyrocketed once he became ceo.
es_419: Cuando se convirtió en CEO, las ganancias anuales se dispararon.

source: ms. kang, this needs to be done by tomorrow.
es_419: Señorita Kang, debe tenerlo hecho para mañana.

source: and taking care of business on top of all that!
es_419: ¡Y además tener que ocuparme de todo!

source: I don't mean you're quitting in order to get married or anything.
es_419: No estoy diciendo que estés renunciando para casarte ni nada.

source: Just think of it as a practice run!
es_419: ¡Puedes pensarlo como una práctica!

source: oh, I can--
es_419: Ah, yo puedo…

source: "take the rest of the day off."
es_419: "Tómate el resto del día".

source: ...the?
es_419: … car…?

source: ta-da!
es_419: ¡TARÁN!

source: whatever it is, you can tell me.
es_419: Sea lo que sea, me puedes decir.

source: *about 2.4 million USD
es_419: * MÁS O MENOS 2,4 MILLONES DE USD.

source: WHiSH
es_419: FIUM

source: waRY
es_419: CAUTELOSA

source: why? is it not to your liking?
es_419: ¿Qué pasa? ¿No te agrada?

source: ...and it was eating me up from the inside.
es_419: … y me estaba carcomiendo por dentro.

source: what was her name?
es_419: ¿Cómo se llama?

source: imported beer four for 10,000 won*
es_419: Cerveza importada Cuatro por 10 000 wones*

source: I've been cramming, but I guess it worked well.
es_419: Estudié mucho, pero supongo que me salió bien.

source: why are you following me?!
es_419: ¡¿Por qué me sigues?!

source: show interest in the child out-of-order
es_419: Muestre interés en el niño descarriado

source: it was a wonderful breakfast.
es_419: El desayuno estuvo genial.

source: clink
es_419: CLINC

source: whirr
es_419: trr

source: "every conversation starts at the meal table."
es_419: "Toda conversación empieza en horas de comida".

source: but you'll be gone in a month.
es_419: Pero te irás en un mes.

source: ta-da
es_419: TARÁN

source: H
es_419: m

source: but to be honest...
es_419: Pero la verdad…

source: look, it’s ms. gam!
es_419: ¡Es la señorita Gam!

source: I'm sure that was hard for you to say, so I'll take it to heart.
es_419: Seguro te costó mucho decírmelo, así que lo tomo en serio.

source: ...yet trying so hard for his family.
es_419: … pero se esfuerza tanto por su familia.

source: ugh.
es_419: Uff.

source: ...that was all I could think of.
es_419: Eso fue lo único que se me ocurrió.

source: please follow quarantine guidelines.
es_419: Procuren seguir las normas de aislamiento.

source: maybe it's because I've come this far in life without having any time to reflect on myself.
es_419: Debe ser porque he llegado tan lejos en la vida, y nunca tuve tiempo de pensar en mí.

source: dohyeok and this girl can't be…
es_419: No puede ser que Dohyeok y ella…

source: I spent all night thinking.
es_419: Me pasé toda la noche pensando.

source: hmm.
es_419: Mmm.

source: you're going on a blind date?
es_419: ¿Irás a una cita a ciegas?

source: it was a blind date.
es_419: Era una cita a ciegas.

source: sullen
es_419: melancólico

source: sure, let me check the schedule.
es_419: Cómo no, me fijo en la agenda.

source: I decided a while ago.
es_419: Lo decidí hace poco.
